testcase/rice_3D/0/fluid/AIR
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      AIR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.9978;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    inlet
    {
        type            fixedValue;
        value           uniform 0.9978;
    }

    oulet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }

    fixedWalls
    {
        type            zeroGradient;
    }

    fluid_to_hull
    {
        type            zeroGradient;
        
        //type            fixedValue;
        //value           uniform 0.79;
        //gradient        uniform 0;
    }
}
