testcase/rice_3D/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 333;
    }

    oulet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    fixedWalls
    {
        type            zeroGradient;
    }
/*
    fluid_to_kernel
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     fluidThermo;
    }
*/
    fluid_to_hull
    {
        type            massTransferCoupled;
        kappaMethod     fluidThermo;
        specie          H2O;
        sourceTerm      HSource;
        Tnbr            T;
        solidCoeff      Dsolid;
        thickness       uniform 0;
        carrierMolWeight 29.8;
        CharaLength     0.0043;
        liquid
        {
            H2O
            {
                defaultCoeffs yes;
            }
        }
        value           $internalField;
    }

}


// ************************************************************************* //
