testcase/rice_3D/0/fluid/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		$internalField;
    }
    oulet
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    fixedWalls
    {
	type 		fixedValue;
	value		$internalField;
    }
    fluid_to_hull
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
