testcase/rice_3D/0/hull/H2O
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.285;

boundaryField
{
    hull_to_fluid
    {
        type            fixedGradient;
        //value           uniform 0.7;
        gradient        uniform 0;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}
