testcase/rice_3D/constant/fluid/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver         noChemistrySolver;
    //chemistryThermo         rho;
}
/*
chemistryType
{
    solver          EulerImplicit;
}*/

chemistry           off;

initialChemicalTimeStep 1e-07;
/*
odeCoeffs
{
    solver          seulex;
    eps             0.05;
}

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}*/

// ************************************************************************* //
