testcase/rice_3D/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       192144;
    }
    oulet
    {
        type            patch;
        nFaces          100;
        startFace       192244;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       192344;
    }
    fluid_to_hull
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          7568;
        startFace       193144;
        sampleMode      nearestPatchFace;
        sampleRegion    hull;
        samplePatch     hull_to_fluid;
    }
)

// ************************************************************************* //
