testcase/rice_3D/constant/hull/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   27; // [g/mol]
    }

    transport
    {
        kappa   0.559;    // [W/m/K]
    }

    thermodynamics
    {
        Hf      0;
        //Cv      800;    // [J/kg/K]
        Cp      2272.14;
    }

    equationOfState
    {
        rho     1403;   // [kg/m^3]
    }
}

// ************************************************************************* //
