testcase/rice_3D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

vertices
(
    (-10 -10 -12)
    (10 -10 -12)
    (10 10 -12)
    (-10 10 -12)
    (-10 -10 18)
    (10 -10 18)
    (10 10 18)
    (-10 10 18)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    oulet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (2 6 5 1)
            (0 4 7 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
