testcase/rice_3D/system/hull/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
	{
		name	htf;
		type	faceSet;
		action	new;
		source	patchToFace;
		patch	"hull_to_fluid";
	}
	{
		name 	c1;
		type	cellSet;
		action 	new;
		source 	surfaceToCell;
		file 	"./constant/triSurface/rice_bran.stl";
		outsidePoints ((0 0 0));
		includeCut	false;
		includeInside false;
		includeOutside true;
		nearDistance   0.00001;
		curvature	0.5;
		fileType	stl;	
	}
	{
		name 	c1;
		type	cellSet;
		action 	subtract;
		source 	surfaceToCell;
		file 	"./constant/triSurface/rice_endosperm.stl";
		outsidePoints ((0 0 0));
		includeCut	false;
		includeInside false;
		includeOutside true;
		nearDistance   0.00001;
		curvature	0.5;
		fileType	stl;
	}
	{
		name 	bran;
		type 	cellZoneSet;
		action new;
		source setToCellZone;
		sourceInfo
		{
			set c1;
		}
	}

	{
		name 	c2;
		type	cellSet;
		action 	new;
		source 	surfaceToCell;
		file 	"./constant/triSurface/rice_endosperm.stl";
		outsidePoints ((0 0 0));
		includeCut	false;
		includeInside false;
		includeOutside true;
		nearDistance   0.00001;
		curvature	0.5;
		fileType	stl;
	}

	{
		name 	endosperm;
		type 	cellZoneSet;
		action new;
		source setToCellZone;
		sourceInfo
		{
			set c2;
		}
	}

);
